<?

$judy=[95,64,70,90,84];
$amo=[88,78,54,81,71];
$john=[45,60,68,70,62];
$peter=[59,32,77,54,42];
$hebe=[71,62,80,62,64];
echo"<pre>"; print_r($judy);echo"</pre>";
$score=[
    "judy"=>[
        "國文"=>95,
        "英文"=>64,
        "數學"=>70,
        "地理"=>90,
        "歷史"=>84,
    ],
    "amo"=>[
        "國文"=>88,
        "英文"=>78,
        "數學"=>54,
        "地理"=>81,
        "歷史"=>71,
    ],
        "john"=>[
            "國文"=>45,
            "英文"=>60,
            "數學"=>68,
            "地理"=>70,
            "歷史"=>62,
    ],
        "peter"=>[
            "國文"=>88,
            "英文"=>78,
            "數學"=>54,
            "地理"=>81,
            "歷史"=>71,
            ]
    ];
    echo "<pre>";print_r($score);echo"<echo>";




    // 

    $a[0]="1*1=1";
    $a[1]="1*2=2";
    $a[2]="1*3=3";
    $a[81]="9*9=81";


    $a=[];
        for($i=1;$i<=9;$i++){
            for($j=1;$j<=9;$j++){
                $a[]=$i." * ".$j." = ". ($i*$j);
            }
        }

        echo "<pre>";print_r($a);echo"<echo>";
    

        // 
        for($i=0;$i<count($a);$i++){
            echo $a[$i]." , ";

            if($i%9==8){
                echo "<br>";
            }
        }

        foreach ($a as $key => $d){

            echo $d." , ";
            if($key%9==8){
                echo "<br>";
            }
        }


       